veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxMinimcds_bf.h
/** \brief Offset for Ifx_MINIMCDS_MUX_TC_RC_Bits.RC */
#define IFX_MINIMCDS_MUX_TC_RC_RC_OFF (24u)

/** \brief Length for Ifx_MINIMCDS_MUX_TC_RC_Bits.RC_P */
#define IFX_MINIMCDS_MUX_TC_RC_RC_P_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_MUX_TC_RC_Bits.RC_P */
#define IFX_MINIMCDS_MUX_TC_RC_RC_P_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_MUX_TC_RC_Bits.RC_P */
#define IFX_MINIMCDS_MUX_TC_RC_RC_P_OFF (27u)

/** \brief Length for Ifx_MINIMCDS_FIFONOW_Bits.NOW */
#define IFX_MINIMCDS_FIFONOW_NOW_LEN (8u)

/** \brief Mask for Ifx_MINIMCDS_FIFONOW_Bits.NOW */
#define IFX_MINIMCDS_FIFONOW_NOW_MSK (0xffu)

/** \brief Offset for Ifx_MINIMCDS_FIFONOW_Bits.NOW */
#define IFX_MINIMCDS_FIFONOW_NOW_OFF (5u)

/** \brief Length for Ifx_MINIMCDS_FIFOBOT_Bits.BOTTOM */
#define IFX_MINIMCDS_FIFOBOT_BOTTOM_LEN (3u)

/** \brief Mask for Ifx_MINIMCDS_FIFOBOT_Bits.BOTTOM */
#define IFX_MINIMCDS_FIFOBOT_BOTTOM_MSK (0x7u)

/** \brief Offset for Ifx_MINIMCDS_FIFOBOT_Bits.BOTTOM */
#define IFX_MINIMCDS_FIFOBOT_BOTTOM_OFF (10u)

/** \brief Length for Ifx_MINIMCDS_FIFOPRE_Bits.PRE */
#define IFX_MINIMCDS_FIFOPRE_PRE_LEN (8u)

/** \brief Mask for Ifx_MINIMCDS_FIFOPRE_Bits.PRE */
#define IFX_MINIMCDS_FIFOPRE_PRE_MSK (0xffu)

/** \brief Offset for Ifx_MINIMCDS_FIFOPRE_Bits.PRE */
#define IFX_MINIMCDS_FIFOPRE_PRE_OFF (5u)

/** \brief Length for Ifx_MINIMCDS_FIFOTOP_Bits.TOP */
#define IFX_MINIMCDS_FIFOTOP_TOP_LEN (8u)

/** \brief Mask for Ifx_MINIMCDS_FIFOTOP_Bits.TOP */
#define IFX_MINIMCDS_FIFOTOP_TOP_MSK (0xffu)

/** \brief Offset for Ifx_MINIMCDS_FIFOTOP_Bits.TOP */
#define IFX_MINIMCDS_FIFOTOP_TOP_OFF (5u)

/** \brief Length for Ifx_MINIMCDS_FIFOCTL_Bits.TRG */
#define IFX_MINIMCDS_FIFOCTL_TRG_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_FIFOCTL_Bits.TRG */
#define IFX_MINIMCDS_FIFOCTL_TRG_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_FIFOCTL_Bits.TRG */
#define IFX_MINIMCDS_FIFOCTL_TRG_OFF (0u)

/** \brief Length for Ifx_MINIMCDS_FIFOCTL_Bits.FFE */
#define IFX_MINIMCDS_FIFOCTL_FFE_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_FIFOCTL_Bits.FFE */
#define IFX_MINIMCDS_FIFOCTL_FFE_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_FIFOCTL_Bits.FFE */
#define IFX_MINIMCDS_FIFOCTL_FFE_OFF (1u)

/** \brief Length for Ifx_MINIMCDS_FIFOCTL_Bits.TRDIS */
#define IFX_MINIMCDS_FIFOCTL_TRDIS_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_FIFOCTL_Bits.TRDIS */
#define IFX_MINIMCDS_FIFOCTL_TRDIS_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_FIFOCTL_Bits.TRDIS */
#define IFX_MINIMCDS_FIFOCTL_TRDIS_OFF (9u)

/** \brief Length for Ifx_MINIMCDS_FIFOCTL_Bits.TRON */
#define IFX_MINIMCDS_FIFOCTL_TRON_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_FIFOCTL_Bits.TRON */
#define IFX_MINIMCDS_FIFOCTL_TRON_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_FIFOCTL_Bits.TRON */
#define IFX_MINIMCDS_FIFOCTL_TRON_OFF (10u)

/** \brief Length for Ifx_MINIMCDS_FIFOCTL_Bits.TROFF */
#define IFX_MINIMCDS_FIFOCTL_TROFF_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_FIFOCTL_Bits.TROFF */
#define IFX_MINIMCDS_FIFOCTL_TROFF_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_FIFOCTL_Bits.TROFF */
#define IFX_MINIMCDS_FIFOCTL_TROFF_OFF (11u)

/** \brief Length for Ifx_MINIMCDS_FIFOCTL_Bits.FLSH */
#define IFX_MINIMCDS_FIFOCTL_FLSH_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_FIFOCTL_Bits.FLSH */
#define IFX_MINIMCDS_FIFOCTL_FLSH_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_FIFOCTL_Bits.FLSH */
#define IFX_MINIMCDS_FIFOCTL_FLSH_OFF (13u)

/** \brief Length for Ifx_MINIMCDS_FIFOCTL_Bits.CLR */
#define IFX_MINIMCDS_FIFOCTL_CLR_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_FIFOCTL_Bits.CLR */
#define IFX_MINIMCDS_FIFOCTL_CLR_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_FIFOCTL_Bits.CLR */
#define IFX_MINIMCDS_FIFOCTL_CLR_OFF (14u)

/** \brief Length for Ifx_MINIMCDS_FIFOCTL_Bits.SET */
#define IFX_MINIMCDS_FIFOCTL_SET_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_FIFOCTL_Bits.SET */
#define IFX_MINIMCDS_FIFOCTL_SET_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_FIFOCTL_Bits.SET */
#define IFX_MINIMCDS_FIFOCTL_SET_OFF (15u)

/** \brief Length for Ifx_MINIMCDS_FIFOWARN_Bits.WARN */
#define IFX_MINIMCDS_FIFOWARN_WARN_LEN (8u)

/** \brief Mask for Ifx_MINIMCDS_FIFOWARN_Bits.WARN */
#define IFX_MINIMCDS_FIFOWARN_WARN_MSK (0xffu)

/** \brief Offset for Ifx_MINIMCDS_FIFOWARN_Bits.WARN */
#define IFX_MINIMCDS_FIFOWARN_WARN_OFF (5u)

/** \brief Length for Ifx_MINIMCDS_FIFOWARN_Bits.EN */
#define IFX_MINIMCDS_FIFOWARN_EN_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_FIFOWARN_Bits.EN */
#define IFX_MINIMCDS_FIFOWARN_EN_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_FIFOWARN_Bits.EN */
#define IFX_MINIMCDS_FIFOWARN_EN_OFF (31u)

/** \brief Length for Ifx_MINIMCDS_FIFOOVRCNT_Bits.COUNT */
#define IFX_MINIMCDS_FIFOOVRCNT_COUNT_LEN (8u)

/** \brief Mask for Ifx_MINIMCDS_FIFOOVRCNT_Bits.COUNT */
#define IFX_MINIMCDS_FIFOOVRCNT_COUNT_MSK (0xffu)

/** \brief Offset for Ifx_MINIMCDS_FIFOOVRCNT_Bits.COUNT */
#define IFX_MINIMCDS_FIFOOVRCNT_COUNT_OFF (0u)

/** \brief Length for Ifx_MINIMCDS_FIFOOVRCNT_Bits.CLR */
#define IFX_MINIMCDS_FIFOOVRCNT_CLR_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_FIFOOVRCNT_Bits.CLR */
#define IFX_MINIMCDS_FIFOOVRCNT_CLR_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_FIFOOVRCNT_Bits.CLR */
#define IFX_MINIMCDS_FIFOOVRCNT_CLR_OFF (15u)

/** \brief Length for Ifx_MINIMCDS_TSUREFCNT_Bits.COUNT */
#define IFX_MINIMCDS_TSUREFCNT_COUNT_LEN (32u)

/** \brief Mask for Ifx_MINIMCDS_TSUREFCNT_Bits.COUNT */
#define IFX_MINIMCDS_TSUREFCNT_COUNT_MSK (0xffffffffu)

/** \brief Offset for Ifx_MINIMCDS_TSUREFCNT_Bits.COUNT */
#define IFX_MINIMCDS_TSUREFCNT_COUNT_OFF (0u)

/** \brief Length for Ifx_MINIMCDS_TSUPRSCL_Bits.RELOAD */
#define IFX_MINIMCDS_TSUPRSCL_RELOAD_LEN (32u)

/** \brief Mask for Ifx_MINIMCDS_TSUPRSCL_Bits.RELOAD */
#define IFX_MINIMCDS_TSUPRSCL_RELOAD_MSK (0xffffffffu)

/** \brief Offset for Ifx_MINIMCDS_TSUPRSCL_Bits.RELOAD */
#define IFX_MINIMCDS_TSUPRSCL_RELOAD_OFF (0u)

/** \brief Length for Ifx_MINIMCDS_TSUEMUCNT_Bits.COUNT */
#define IFX_MINIMCDS_TSUEMUCNT_COUNT_LEN (32u)

/** \brief Mask for Ifx_MINIMCDS_TSUEMUCNT_Bits.COUNT */
#define IFX_MINIMCDS_TSUEMUCNT_COUNT_MSK (0xffffffffu)

/** \brief Offset for Ifx_MINIMCDS_TSUEMUCNT_Bits.COUNT */
#define IFX_MINIMCDS_TSUEMUCNT_COUNT_OFF (0u)

